Model: "ttc_AE_V2_PINN_fft"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 pad10 (ZeroPadding2D)       multiple                  0         
                                                                 
 crop_back (CenterCrop)      multiple                  0         
                                                                 
 conv2d (Conv2D)             multiple                  352       
                                                                 
 conv2d_1 (Conv2D)           multiple                  10784     
                                                                 
 conv2d_2 (Conv2D)           multiple                  25632     
                                                                 
 conv2d_transpose (Conv2DTr  multiple                  25632     
 anspose)                                                        
                                                                 
 conv2d_transpose_1 (Conv2D  multiple                  4624      
 Transpose)                                                      
                                                                 
 conv2d_3 (Conv2D)           multiple                  145       
                                                                 
=================================================================
Total params: 67169 (262.38 KB)
Trainable params: 67169 (262.38 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
