Model: "ttc_AE_V2_PINN_fft"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 pad10 (ZeroPadding2D)       multiple                  0         
                                                                 
 crop_back (CenterCrop)      multiple                  0         
                                                                 
 conv2d (Conv2D)             multiple                  352       
                                                                 
 conv2d_1 (Conv2D)           multiple                  10784     
                                                                 
 conv2d_2 (Conv2D)           multiple                  25632     
                                                                 
 conv2d_transpose (Conv2DTra  multiple                 25632     
 nspose)                                                         
                                                                 
 conv2d_transpose_1 (Conv2DT  multiple                 4624      
 ranspose)                                                       
                                                                 
 conv2d_3 (Conv2D)           multiple                  145       
                                                                 
=================================================================
Total params: 67,169
Trainable params: 67,169
Non-trainable params: 0
_________________________________________________________________
